//정보처리기사 필기
//1과목 소프트웨어 설계
//소프트웨어 생명 주기
1. 폭포수 모형
- 선형 순차적 모형 : 한 단계가 끝나야만 다음 단계로 넘어감
- 가장 오래되고 폭넓게 사용됨 >> 고전적 생명 주기 모형
- (타장성 검토 > 계획 > ) 요구 분석 > 설계 > 구현 > 테스트(검사) > 유지보수
#분설구테유
장 : 단계별 정의 및 산출물이 명확
단 : 개발 중간에 요구 사항 변경이 어려움

2. 프로토타입 모형 = 원형 모형
- 견본품을 만들어 최종 결과물을 예측
- 인터페이스에 중점
장 : 개발 중간에 요구사항 변경이 쉬움

3. 나선형 모델 = 점진적 모델
- 폭포수 장점 + 프로토타입 장점 + 위험 분석 기능
- 점진적 개발 과정 반복 >> 요구사항 추가 가능
- 정밀함
- 유지보수 과정 필요 없음
- 계획 및 정의 > 위험 분석 > 공학적 개발 > 고객 평가
#계위개고

4.애자일 모형 (애자일 : 민첩하다, 기민하다는 뜻)
- 일정한 주기를 반복하면서 개발 과정 진행
- 기능 중심 개발
- 고객과의 소통에 초점
-eXtreme Programming, 스크럼, 칸반, 크리스탈, 린
#엑스칸크린
장 : 변화에 유연하게 대응 가능


//스크럼 기법 ... 애자일 개발 과정의 하나
스크럼 기법
- 팀원 스스로가 스크럼 팀 구성
- 개발 작업에 관한 모든 것을 스스로 해결해야 함
- 스프린트는 2~4주 정도의 기간으로 진행(스프린트 : 반복적인 개발 주기)

- 스크럼 개발 프로세스
  스프린트 계획 회의 > 스프린트 > 일일 스크럼 회의 > 스크럼 검토 회의 > 스프린트 회고
#계스일검회

1) 제품 책임자(Product Owner)
- 요구 사항이 담긴 백로그를 작성하는 주체 >> 의뢰자
- 백로그에 대한 우선 순위를 지정
- 이해관계자들의 의견을 종합

2) 스크럼 마스터(Scrum Master)
- 일일 스크럼 회의 주관
- 팀원들을 통제하는 것이 목표가 아님

3) 개발팀(Development Team)
- 제품 책임자와 스크럼 마스터를 제외한 모든 팀원
- 최대 인원 7~8인


//XP(eXtreme Programming)
1) XP의 핵심 가치
- 용기
- 단순성
- 의사소통
- 피드백
- 존중
#용단의피존

2) XP의 기본원리
- Whole Team
- Small Releases
- Test-Driven Development
- Continuous Intergration
- Collective Ownership
- Pair Programming
- Design Improvement / Refactoring
